Autodesk.Revit.DB.Structure.LineLoadTypeSet
A set that contains lineload types.

Autodesk.Revit.DB.Structure.LineLoadTypeSet.Insert(Autodesk.Revit.DB.Structure.LineLoadType)
System.Int32
Insert the specified lineload type into the set.
item: The lineload type to be inserted into the set.
Returns: Returns whether the lineload type was inserted into the set.

Autodesk.Revit.DB.Structure.LineLoadTypeSet.GetEnumerator
System.Collections.IEnumerator
Retrieve a forward moving iterator to the set.
Returns: Returns a forward moving iterator to the set.

Autodesk.Revit.DB.Structure.LineLoadTypeSet.ReverseIterator
Autodesk.Revit.DB.Structure.LineLoadTypeSetIterator
Retrieve a backward moving iterator to the set.
Returns: Returns a backward moving iterator to the set.

Autodesk.Revit.DB.Structure.LineLoadTypeSet.ForwardIterator
Autodesk.Revit.DB.Structure.LineLoadTypeSetIterator
Retrieve a forward moving iterator to the set.
Returns: Returns a forward moving iterator to the set.

Autodesk.Revit.DB.Structure.LineLoadTypeSet.Erase(Autodesk.Revit.DB.Structure.LineLoadType)
System.Int32
Removes a specified lineload type from the set.
item: The lineload type to be erased.
Returns: The number of lineload types that were erased from the set.

Autodesk.Revit.DB.Structure.LineLoadTypeSet.Contains(Autodesk.Revit.DB.Structure.LineLoadType)
System.Boolean
Tests for the existence of a lineload type within the set.
item: The lineload type to be searched for.
Returns: The Contains method returns True if the lineload type is within the set, otherwise False.

Autodesk.Revit.DB.Structure.LineLoadTypeSet.Clear
void
Removes every lineload type from the set, rendering it empty.

Autodesk.Revit.DB.Structure.LineLoadTypeSet.Size
System.Int32
get
Returns the number of lineload types that are in the set.

Autodesk.Revit.DB.Structure.LineLoadTypeSet.IsEmpty
System.Boolean
get
Test to see if the set is empty.
Remarks: If the set is empty then True will be returned, otherwise False.